MikroElektronika/core_packages/dsPIC/XC16/def/PIC24EP256GU810/mcu.h
extern volatile RPOR14BITS RPOR14bits __attribute__((__sfr__));

#define RPOR15 RPOR15
extern volatile uint16_t RPOR15 __attribute__((__sfr__));
__extension__ typedef struct tagRPOR15BITS {
  union {
    struct {
      uint16_t RP126R:6;
      uint16_t :2;
      uint16_t RP127R:6;
    };
    struct {
      uint16_t RP126R0:1;
      uint16_t RP126R1:1;
      uint16_t RP126R2:1;
      uint16_t RP126R3:1;
      uint16_t RP126R4:1;
      uint16_t RP126R5:1;
      uint16_t :2;
      uint16_t RP127R0:1;
      uint16_t RP127R1:1;
      uint16_t RP127R2:1;
      uint16_t RP127R3:1;
      uint16_t RP127R4:1;
      uint16_t RP127R5:1;
    };
  };
} RPOR15BITS;
extern volatile RPOR15BITS RPOR15bits __attribute__((__sfr__));

#define RPINR0 RPINR0
extern volatile uint16_t RPINR0 __attribute__((__sfr__));
__extension__ typedef struct tagRPINR0BITS {
  union {
    struct {
      uint16_t :8;
      uint16_t INT1R:7;
    };
    struct {
      uint16_t :8;
      uint16_t INT1R0:1;
      uint16_t INT1R1:1;
      uint16_t INT1R2:1;
      uint16_t INT1R3:1;
      uint16_t INT1R4:1;
      uint16_t INT1R5:1;
      uint16_t INT1R6:1;
    };
  };
} RPINR0BITS;
extern volatile RPINR0BITS RPINR0bits __attribute__((__sfr__));

#define RPINR1 RPINR1
extern volatile uint16_t RPINR1 __attribute__((__sfr__));
__extension__ typedef struct tagRPINR1BITS {
  union {
    struct {
      uint16_t INT2R:7;
      uint16_t :1;
      uint16_t INT3R:7;
    };
    struct {
      uint16_t INT2R0:1;
      uint16_t INT2R1:1;
      uint16_t INT2R2:1;
      uint16_t INT2R3:1;
      uint16_t INT2R4:1;
      uint16_t INT2R5:1;
      uint16_t INT2R6:1;
      uint16_t :1;
      uint16_t INT3R0:1;
      uint16_t INT3R1:1;
      uint16_t INT3R2:1;
      uint16_t INT3R3:1;
      uint16_t INT3R4:1;
      uint16_t INT3R5:1;
      uint16_t INT3R6:1;
    };
  };
} RPINR1BITS;
extern volatile RPINR1BITS RPINR1bits __attribute__((__sfr__));

#define RPINR2 RPINR2
extern volatile uint16_t RPINR2 __attribute__((__sfr__));
__extension__ typedef struct tagRPINR2BITS {
  union {
    struct {
      uint16_t INT4R:7;
      uint16_t :1;
      uint16_t RSVR:7;
    };
    struct {
      uint16_t INT4R0:1;
      uint16_t INT4R1:1;
      uint16_t INT4R2:1;
      uint16_t INT4R3:1;
      uint16_t INT4R4:1;
      uint16_t INT4R5:1;
      uint16_t INT4R6:1;
      uint16_t :1;
      uint16_t RSVR0:1;
      uint16_t RSVR1:1;
      uint16_t RSVR2:1;
      uint16_t RSVR3:1;
      uint16_t RSVR4:1;
      uint16_t RSVR5:1;
      uint16_t RSVR6:1;
    };
  };
} RPINR2BITS;
extern volatile RPINR2BITS RPINR2bits __attribute__((__sfr__));

#define RPINR3 RPINR3
extern volatile uint16_t RPINR3 __attribute__((__sfr__));
__extension__ typedef struct tagRPINR3BITS {
  union {
    struct {
      uint16_t T2CKR:7;
      uint16_t :1;
      uint16_t T3CKR:7;
    };
    struct {
      uint16_t T2CKR0:1;
      uint16_t T2CKR1:1;
      uint16_t T2CKR2:1;
      uint16_t T2CKR3:1;
      uint16_t T2CKR4:1;
      uint16_t T2CKR5:1;
      uint16_t T2CKR6:1;
      uint16_t :1;
      uint16_t T3CKR0:1;
      uint16_t T3CKR1:1;
      uint16_t T3CKR2:1;
      uint16_t T3CKR3:1;
      uint16_t T3CKR4:1;
      uint16_t T3CKR5:1;
      uint16_t T3CKR6:1;
    };
  };
} RPINR3BITS;
extern volatile RPINR3BITS RPINR3bits __attribute__((__sfr__));

#define RPINR4 RPINR4
extern volatile uint16_t RPINR4 __attribute__((__sfr__));
__extension__ typedef struct tagRPINR4BITS {
  union {
    struct {
      uint16_t T4CKR:7;
      uint16_t :1;
      uint16_t T5CKR:7;
    };
    struct {
      uint16_t T4CKR0:1;
      uint16_t T4CKR1:1;
      uint16_t T4CKR2:1;
      uint16_t T4CKR3:1;
      uint16_t T4CKR4:1;
      uint16_t T4CKR5:1;
      uint16_t T4CKR6:1;
      uint16_t :1;
      uint16_t T5CKR0:1;
      uint16_t T5CKR1:1;
      uint16_t T5CKR2:1;
      uint16_t T5CKR3:1;
      uint16_t T5CKR4:1;
      uint16_t T5CKR5:1;
      uint16_t T5CKR6:1;
    };
  };
} RPINR4BITS;
extern volatile RPINR4BITS RPINR4bits __attribute__((__sfr__));

#define RPINR5 RPINR5
extern volatile uint16_t RPINR5 __attribute__((__sfr__));
__extension__ typedef struct tagRPINR5BITS {
  union {
    struct {
      uint16_t T6CKR:7;
      uint16_t :1;
      uint16_t T7CKR:7;
    };
    struct {
      uint16_t T6CKR0:1;
      uint16_t T6CKR1:1;
      uint16_t T6CKR2:1;
      uint16_t T6CKR3:1;
      uint16_t T6CKR4:1;
      uint16_t T6CKR5:1;
      uint16_t T6CKR6:1;
      uint16_t :1;
      uint16_t T7CKR0:1;
      uint16_t T7CKR1:1;
      uint16_t T7CKR2:1;
      uint16_t T7CKR3:1;
      uint16_t T7CKR4:1;
      uint16_t T7CKR5:1;
      uint16_t T7CKR6:1;
    };
  };
} RPINR5BITS;
extern volatile RPINR5BITS RPINR5bits __attribute__((__sfr__));

#define RPINR6 RPINR6
extern volatile uint16_t RPINR6 __attribute__((__sfr__));
__extension__ typedef struct tagRPINR6BITS {
  union {
    struct {
      uint16_t T8CKR:7;
      uint16_t :1;
      uint16_t T9CKR:7;
    };
    struct {
      uint16_t T8CKR0:1;
      uint16_t T8CKR1:1;
      uint16_t T8CKR2:1;
      uint16_t T8CKR3:1;
      uint16_t T8CKR4:1;
      uint16_t T8CKR5:1;
      uint16_t T8CKR6:1;
      uint16_t :1;
      uint16_t T9CKR0:1;
      uint16_t T9CKR1:1;
      uint16_t T9CKR2:1;
      uint16_t T9CKR3:1;
      uint16_t T9CKR4:1;
      uint16_t T9CKR5:1;
      uint16_t T9CKR6:1;
    };
  };
} RPINR6BITS;
extern volatile RPINR6BITS RPINR6bits __attribute__((__sfr__));

#define RPINR7 RPINR7
extern volatile uint16_t RPINR7 __attribute__((__sfr__));
__extension__ typedef struct tagRPINR7BITS {
  union {
    struct {
      uint16_t IC1R:7;
      uint16_t :1;
      uint16_t IC2R:7;
    };
    struct {
      uint16_t IC1R0:1;
      uint16_t IC1R1:1;
      uint16_t IC1R2:1;
      uint16_t IC1R3:1;
      uint16_t IC1R4:1;
      uint16_t IC1R5:1;
      uint16_t IC1R6:1;
      uint16_t :1;
      uint16_t IC2R0:1;
      uint16_t IC2R1:1;
      uint16_t IC2R2:1;
      uint16_t IC2R3:1;
      uint16_t IC2R4:1;
      uint16_t IC2R5:1;
      uint16_t IC2R6:1;
    };
  };
} RPINR7BITS;
extern volatile RPINR7BITS RPINR7bits __attribute__((__sfr__));

#define RPINR8 RPINR8
extern volatile uint16_t RPINR8 __attribute__((__sfr__));
__extension__ typedef struct tagRPINR8BITS {
  union {
    struct {
      uint16_t IC3R:7;
      uint16_t :1;
      uint16_t IC4R:7;
    };
    struct {
      uint16_t IC3R0:1;
      uint16_t IC3R1:1;
      uint16_t IC3R2:1;
      uint16_t IC3R3:1;
      uint16_t IC3R4:1;
      uint16_t IC3R5:1;
      uint16_t IC3R6:1;
      uint16_t :1;
      uint16_t IC4R0:1;
      uint16_t IC4R1:1;
      uint16_t IC4R2:1;
      uint16_t IC4R3:1;
      uint16_t IC4R4:1;
      uint16_t IC4R5:1;
      uint16_t IC4R6:1;
    };
  };
} RPINR8BITS;
extern volatile RPINR8BITS RPINR8bits __attribute__((__sfr__));

#define RPINR9 RPINR9
extern volatile uint16_t RPINR9 __attribute__((__sfr__));
__extension__ typedef struct tagRPINR9BITS {
  union {
    struct {
      uint16_t IC5R:7;
      uint16_t :1;
      uint16_t IC6R:7;
    };
    struct {
      uint16_t IC5R0:1;
      uint16_t IC5R1:1;
      uint16_t IC5R2:1;
      uint16_t IC5R3:1;
      uint16_t IC5R4:1;
      uint16_t IC5R5:1;
      uint16_t IC5R6:1;
      uint16_t :1;
      uint16_t IC6R0:1;
      uint16_t IC6R1:1;
      uint16_t IC6R2:1;
      uint16_t IC6R3:1;
      uint16_t IC6R4:1;
      uint16_t IC6R5:1;
      uint16_t IC6R6:1;
    };
  };
} RPINR9BITS;
extern volatile RPINR9BITS RPINR9bits __attribute__((__sfr__));

#define RPINR10 RPINR10
extern volatile uint16_t RPINR10 __attribute__((__sfr__));
__extension__ typedef struct tagRPINR10BITS {
  union {
    struct {
      uint16_t IC7R:7;
      uint16_t :1;
      uint16_t IC8R:7;
    };
    struct {
      uint16_t IC7R0:1;
      uint16_t IC7R1:1;
      uint16_t IC7R2:1;
      uint16_t IC7R3:1;
      uint16_t IC7R4:1;
      uint16_t IC7R5:1;
      uint16_t IC7R6:1;
      uint16_t :1;
      uint16_t IC8R0:1;
      uint16_t IC8R1:1;
      uint16_t IC8R2:1;
      uint16_t IC8R3:1;
      uint16_t IC8R4:1;
      uint16_t IC8R5:1;
      uint16_t IC8R6:1;
    };
  };
} RPINR10BITS;
extern volatile RPINR10BITS RPINR10bits __attribute__((__sfr__));

