MikroElektronika/core_packages/dsPIC/XC16/def/PIC24EP256GU810/mcu.h
extern volatile DMA13CNTBITS DMA13CNTbits __attribute__((__sfr__));

#define DMA14CON DMA14CON
extern volatile uint16_t DMA14CON __attribute__((__sfr__));
__extension__ typedef struct tagDMA14CONBITS {
  union {
    struct {
      uint16_t MODE:2;
      uint16_t :2;
      uint16_t AMODE:2;
      uint16_t :5;
      uint16_t NULLW:1;
      uint16_t HALF:1;
      uint16_t DIR:1;
      uint16_t SIZE:1;
      uint16_t CHEN:1;
    };
    struct {
      uint16_t MODE0:1;
      uint16_t MODE1:1;
      uint16_t :2;
      uint16_t AMODE0:1;
      uint16_t AMODE1:1;
    };
  };
} DMA14CONBITS;
extern volatile DMA14CONBITS DMA14CONbits __attribute__((__sfr__));

#define DMA14REQ DMA14REQ
extern volatile uint16_t DMA14REQ __attribute__((__sfr__));
__extension__ typedef struct tagDMA14REQBITS {
  union {
    struct {
      uint16_t IRQSEL:8;
      uint16_t :7;
      uint16_t FORCE:1;
    };
    struct {
      uint16_t IRQSEL0:1;
      uint16_t IRQSEL1:1;
      uint16_t IRQSEL2:1;
      uint16_t IRQSEL3:1;
      uint16_t IRQSEL4:1;
      uint16_t IRQSEL5:1;
      uint16_t IRQSEL6:1;
      uint16_t IRQSEL7:1;
    };
  };
} DMA14REQBITS;
extern volatile DMA14REQBITS DMA14REQbits __attribute__((__sfr__));

#define DMA14STAL DMA14STAL
extern volatile uint16_t DMA14STAL __attribute__((__sfr__));
#define DMA14STAH DMA14STAH
extern volatile uint16_t DMA14STAH __attribute__((__sfr__));
typedef struct tagDMA14STAHBITS {
  uint16_t STA:8;
} DMA14STAHBITS;
extern volatile DMA14STAHBITS DMA14STAHbits __attribute__((__sfr__));

#define DMA14STBL DMA14STBL
extern volatile uint16_t DMA14STBL __attribute__((__sfr__));
#define DMA14STBH DMA14STBH
extern volatile uint16_t DMA14STBH __attribute__((__sfr__));
typedef struct tagDMA14STBHBITS {
  uint16_t STB:8;
} DMA14STBHBITS;
extern volatile DMA14STBHBITS DMA14STBHbits __attribute__((__sfr__));

#define DMA14PAD DMA14PAD
extern volatile uint16_t DMA14PAD __attribute__((__sfr__));
#define DMA14CNT DMA14CNT
extern volatile uint16_t DMA14CNT __attribute__((__sfr__));
typedef struct tagDMA14CNTBITS {
  uint16_t CNT:14;
} DMA14CNTBITS;
extern volatile DMA14CNTBITS DMA14CNTbits __attribute__((__sfr__));

#define DMAPWC DMAPWC
extern volatile uint16_t DMAPWC __attribute__((__sfr__));
typedef struct tagDMAPWCBITS {
  uint16_t PWCOL0:1;
  uint16_t PWCOL1:1;
  uint16_t PWCOL2:1;
  uint16_t PWCOL3:1;
  uint16_t PWCOL4:1;
  uint16_t PWCOL5:1;
  uint16_t PWCOL6:1;
  uint16_t PWCOL7:1;
  uint16_t PWCOL8:1;
  uint16_t PWCOL9:1;
  uint16_t PWCOL10:1;
  uint16_t PWCOL11:1;
  uint16_t PWCOL12:1;
  uint16_t PWCOL13:1;
  uint16_t PWCOL14:1;
} DMAPWCBITS;
extern volatile DMAPWCBITS DMAPWCbits __attribute__((__sfr__));

#define DMARQC DMARQC
extern volatile uint16_t DMARQC __attribute__((__sfr__));
typedef struct tagDMARQCBITS {
  uint16_t RQCOL0:1;
  uint16_t RQCOL1:1;
  uint16_t RQCOL2:1;
  uint16_t RQCOL3:1;
  uint16_t RQCOL4:1;
  uint16_t RQCOL5:1;
  uint16_t RQCOL6:1;
  uint16_t RQCOL7:1;
  uint16_t RQCOL8:1;
  uint16_t RQCOL9:1;
  uint16_t RQCOL10:1;
  uint16_t RQCOL11:1;
  uint16_t RQCOL12:1;
  uint16_t RQCOL13:1;
  uint16_t RQCOL14:1;
} DMARQCBITS;
extern volatile DMARQCBITS DMARQCbits __attribute__((__sfr__));

#define DMAPPS DMAPPS
extern volatile uint16_t DMAPPS __attribute__((__sfr__));
typedef struct tagDMAPPSBITS {
  uint16_t PPST0:1;
  uint16_t PPST1:1;
  uint16_t PPST2:1;
  uint16_t PPST3:1;
  uint16_t PPST4:1;
  uint16_t PPST5:1;
  uint16_t PPST6:1;
  uint16_t PPST7:1;
  uint16_t PPST8:1;
  uint16_t PPST9:1;
  uint16_t PPST10:1;
  uint16_t PPST11:1;
  uint16_t PPST12:1;
  uint16_t PPST13:1;
  uint16_t PPST14:1;
} DMAPPSBITS;
extern volatile DMAPPSBITS DMAPPSbits __attribute__((__sfr__));

#define DMALCA DMALCA
extern volatile uint16_t DMALCA __attribute__((__sfr__));
__extension__ typedef struct tagDMALCABITS {
  union {
    struct {
      uint16_t LSTCH:4;
    };
    struct {
      uint16_t LSTCH0:1;
      uint16_t LSTCH1:1;
      uint16_t LSTCH2:1;
      uint16_t LSTCH3:1;
    };
  };
} DMALCABITS;
extern volatile DMALCABITS DMALCAbits __attribute__((__sfr__));

#define DSADRL DSADRL
extern volatile uint16_t DSADRL __attribute__((__sfr__));
#define DSADRH DSADRH
extern volatile uint16_t DSADRH __attribute__((__sfr__));
typedef struct tagDSADRHBITS {
  uint16_t DSADR:8;
} DSADRHBITS;
extern volatile DSADRHBITS DSADRHbits __attribute__((__sfr__));

#define TRISA TRISA
extern volatile uint16_t TRISA __attribute__((__sfr__));
typedef struct tagTRISABITS {
  uint16_t TRISA0:1;
  uint16_t TRISA1:1;
  uint16_t TRISA2:1;
  uint16_t TRISA3:1;
  uint16_t TRISA4:1;
  uint16_t TRISA5:1;
  uint16_t TRISA6:1;
  uint16_t TRISA7:1;
  uint16_t :1;
  uint16_t TRISA9:1;
  uint16_t TRISA10:1;
  uint16_t :3;
  uint16_t TRISA14:1;
  uint16_t TRISA15:1;
} TRISABITS;
extern volatile TRISABITS TRISAbits __attribute__((__sfr__));

#define PORTA PORTA
extern volatile uint16_t PORTA __attribute__((__sfr__));
typedef struct tagPORTABITS {
  uint16_t RA0:1;
  uint16_t RA1:1;
  uint16_t RA2:1;
  uint16_t RA3:1;
  uint16_t RA4:1;
  uint16_t RA5:1;
  uint16_t RA6:1;
  uint16_t RA7:1;
  uint16_t :1;
  uint16_t RA9:1;
  uint16_t RA10:1;
  uint16_t :3;
  uint16_t RA14:1;
  uint16_t RA15:1;
} PORTABITS;
extern volatile PORTABITS PORTAbits __attribute__((__sfr__));

#define LATA LATA
extern volatile uint16_t LATA __attribute__((__sfr__));
typedef struct tagLATABITS {
  uint16_t LATA0:1;
  uint16_t LATA1:1;
  uint16_t LATA2:1;
  uint16_t LATA3:1;
  uint16_t LATA4:1;
  uint16_t LATA5:1;
  uint16_t LATA6:1;
  uint16_t LATA7:1;
  uint16_t :1;
  uint16_t LATA9:1;
  uint16_t LATA10:1;
  uint16_t :3;
  uint16_t LATA14:1;
  uint16_t LATA15:1;
} LATABITS;
extern volatile LATABITS LATAbits __attribute__((__sfr__));

#define ODCA ODCA
extern volatile uint16_t ODCA __attribute__((__sfr__));
typedef struct tagODCABITS {
  uint16_t ODCA0:1;
  uint16_t ODCA1:1;
  uint16_t ODCA2:1;
  uint16_t ODCA3:1;
  uint16_t ODCA4:1;
  uint16_t ODCA5:1;
  uint16_t :8;
  uint16_t ODCA14:1;
  uint16_t ODCA15:1;
} ODCABITS;
extern volatile ODCABITS ODCAbits __attribute__((__sfr__));

#define CNENA CNENA
extern volatile uint16_t CNENA __attribute__((__sfr__));
typedef struct tagCNENABITS {
  uint16_t CNIEA0:1;
  uint16_t CNIEA1:1;
  uint16_t CNIEA2:1;
  uint16_t CNIEA3:1;
  uint16_t CNIEA4:1;
  uint16_t CNIEA5:1;
  uint16_t CNIEA6:1;
  uint16_t CNIEA7:1;
  uint16_t :1;
  uint16_t CNIEA9:1;
  uint16_t CNIEA10:1;
  uint16_t :3;
  uint16_t CNIEA14:1;
  uint16_t CNIEA15:1;
} CNENABITS;
extern volatile CNENABITS CNENAbits __attribute__((__sfr__));

#define CNPUA CNPUA
extern volatile uint16_t CNPUA __attribute__((__sfr__));
typedef struct tagCNPUABITS {
  uint16_t CNPUA0:1;
  uint16_t CNPUA1:1;
  uint16_t CNPUA2:1;
  uint16_t CNPUA3:1;
  uint16_t CNPUA4:1;
  uint16_t CNPUA5:1;
  uint16_t CNPUA6:1;
  uint16_t CNPUA7:1;
  uint16_t :1;
  uint16_t CNPUA9:1;
  uint16_t CNPUA10:1;
  uint16_t :3;
  uint16_t CNPUA14:1;
  uint16_t CNPUA15:1;
} CNPUABITS;
