MikroElektronika/core_packages/dsPIC/XC16/def/PIC24EP256GU810/mcu.h
/* RPINR42 */
#define _DTCMP5R RPINR42bits.DTCMP5R
#define _DTCMP6R RPINR42bits.DTCMP6R
#define _DTCMP5R0 RPINR42bits.DTCMP5R0
#define _DTCMP5R1 RPINR42bits.DTCMP5R1
#define _DTCMP5R2 RPINR42bits.DTCMP5R2
#define _DTCMP5R3 RPINR42bits.DTCMP5R3
#define _DTCMP5R4 RPINR42bits.DTCMP5R4
#define _DTCMP5R5 RPINR42bits.DTCMP5R5
#define _DTCMP5R6 RPINR42bits.DTCMP5R6
#define _DTCMP6R0 RPINR42bits.DTCMP6R0
#define _DTCMP6R1 RPINR42bits.DTCMP6R1
#define _DTCMP6R2 RPINR42bits.DTCMP6R2
#define _DTCMP6R3 RPINR42bits.DTCMP6R3
#define _DTCMP6R4 RPINR42bits.DTCMP6R4
#define _DTCMP6R5 RPINR42bits.DTCMP6R5
#define _DTCMP6R6 RPINR42bits.DTCMP6R6

/* RPINR43 */
#define _DTCMP7R RPINR43bits.DTCMP7R
#define _DTCMP7R0 RPINR43bits.DTCMP7R0
#define _DTCMP7R1 RPINR43bits.DTCMP7R1
#define _DTCMP7R2 RPINR43bits.DTCMP7R2
#define _DTCMP7R3 RPINR43bits.DTCMP7R3
#define _DTCMP7R4 RPINR43bits.DTCMP7R4
#define _DTCMP7R5 RPINR43bits.DTCMP7R5
#define _DTCMP7R6 RPINR43bits.DTCMP7R6

/* RPINR45 */
#define _SYNCI1R RPINR45bits.SYNCI1R
#define _SYNCI2R RPINR45bits.SYNCI2R
#define _SYNCI1R0 RPINR45bits.SYNCI1R0
#define _SYNCI1R1 RPINR45bits.SYNCI1R1
#define _SYNCI1R2 RPINR45bits.SYNCI1R2
#define _SYNCI1R3 RPINR45bits.SYNCI1R3
#define _SYNCI1R4 RPINR45bits.SYNCI1R4
#define _SYNCI1R5 RPINR45bits.SYNCI1R5
#define _SYNCI1R6 RPINR45bits.SYNCI1R6
#define _SYNCI2R0 RPINR45bits.SYNCI2R0
#define _SYNCI2R1 RPINR45bits.SYNCI2R1
#define _SYNCI2R2 RPINR45bits.SYNCI2R2
#define _SYNCI2R3 RPINR45bits.SYNCI2R3
#define _SYNCI2R4 RPINR45bits.SYNCI2R4
#define _SYNCI2R5 RPINR45bits.SYNCI2R5
#define _SYNCI2R6 RPINR45bits.SYNCI2R6

/* NVMCON */
#define _NVMOP NVMCONbits.NVMOP
#define _NVMSIDL NVMCONbits.NVMSIDL
#define _WRERR NVMCONbits.WRERR
#define _WREN NVMCONbits.WREN
#define _WR NVMCONbits.WR
#define _NVMOP0 NVMCONbits.NVMOP0
#define _NVMOP1 NVMCONbits.NVMOP1
#define _NVMOP2 NVMCONbits.NVMOP2
#define _NVMOP3 NVMCONbits.NVMOP3

/* NVMADRU */
#define _NVMADRU NVMADRUbits.NVMADRU

/* RCON */
#define _POR RCONbits.POR
#define _BOR RCONbits.BOR
#define _IDLE RCONbits.IDLE
#define _SLEEP RCONbits.SLEEP
#define _WDTO RCONbits.WDTO
#define _SWDTEN RCONbits.SWDTEN
#define _SWR RCONbits.SWR
#define _EXTR RCONbits.EXTR
#define _VREGS RCONbits.VREGS
#define _CM RCONbits.CM
#define _VREGSF RCONbits.VREGSF
#define _IOPUWR RCONbits.IOPUWR
#define _TRAPR RCONbits.TRAPR

/* OSCCON */
#define _OSWEN OSCCONbits.OSWEN
#define _LPOSCEN OSCCONbits.LPOSCEN
#define _CF OSCCONbits.CF
#define _LOCK OSCCONbits.LOCK
#define _IOLOCK OSCCONbits.IOLOCK
#define _CLKLOCK OSCCONbits.CLKLOCK
#define _NOSC OSCCONbits.NOSC
#define _COSC OSCCONbits.COSC
#define _NOSC0 OSCCONbits.NOSC0
#define _NOSC1 OSCCONbits.NOSC1
#define _NOSC2 OSCCONbits.NOSC2
#define _COSC0 OSCCONbits.COSC0
#define _COSC1 OSCCONbits.COSC1
#define _COSC2 OSCCONbits.COSC2

/* CLKDIV */
#define _PLLPRE CLKDIVbits.PLLPRE
#define _PLLPOST CLKDIVbits.PLLPOST
#define _FRCDIV CLKDIVbits.FRCDIV
#define _DOZEN CLKDIVbits.DOZEN
#define _DOZE CLKDIVbits.DOZE
#define _ROI CLKDIVbits.ROI
#define _PLLPRE0 CLKDIVbits.PLLPRE0
#define _PLLPRE1 CLKDIVbits.PLLPRE1
#define _PLLPRE2 CLKDIVbits.PLLPRE2
#define _PLLPRE3 CLKDIVbits.PLLPRE3
#define _PLLPRE4 CLKDIVbits.PLLPRE4
#define _PLLPOST0 CLKDIVbits.PLLPOST0
#define _PLLPOST1 CLKDIVbits.PLLPOST1
#define _FRCDIV0 CLKDIVbits.FRCDIV0
#define _FRCDIV1 CLKDIVbits.FRCDIV1
#define _FRCDIV2 CLKDIVbits.FRCDIV2
#define _DOZE0 CLKDIVbits.DOZE0
#define _DOZE1 CLKDIVbits.DOZE1
#define _DOZE2 CLKDIVbits.DOZE2

/* PLLFBD */
#define _PLLDIV PLLFBDbits.PLLDIV
#define _PLLDIV0 PLLFBDbits.PLLDIV0
#define _PLLDIV1 PLLFBDbits.PLLDIV1
#define _PLLDIV2 PLLFBDbits.PLLDIV2
#define _PLLDIV3 PLLFBDbits.PLLDIV3
#define _PLLDIV4 PLLFBDbits.PLLDIV4
#define _PLLDIV5 PLLFBDbits.PLLDIV5
#define _PLLDIV6 PLLFBDbits.PLLDIV6
#define _PLLDIV7 PLLFBDbits.PLLDIV7
#define _PLLDIV8 PLLFBDbits.PLLDIV8

/* OSCTUN */
#define _TUN OSCTUNbits.TUN
#define _TUN0 OSCTUNbits.TUN0
#define _TUN1 OSCTUNbits.TUN1
#define _TUN2 OSCTUNbits.TUN2
#define _TUN3 OSCTUNbits.TUN3
#define _TUN4 OSCTUNbits.TUN4
#define _TUN5 OSCTUNbits.TUN5

/* REFOCON */
#define _RODIV REFOCONbits.RODIV
#define _ROSEL REFOCONbits.ROSEL
#define _ROSSLP REFOCONbits.ROSSLP
#define _ROON REFOCONbits.ROON
#define _RODIV0 REFOCONbits.RODIV0
#define _RODIV1 REFOCONbits.RODIV1
#define _RODIV2 REFOCONbits.RODIV2
#define _RODIV3 REFOCONbits.RODIV3

/* ACLKCON3 */
#define _APLLPRE ACLKCON3bits.APLLPRE
#define _APLLPOST ACLKCON3bits.APLLPOST
#define _FRCSEL ACLKCON3bits.FRCSEL
#define _ASRCSEL ACLKCON3bits.ASRCSEL
#define _AOSCMD ACLKCON3bits.AOSCMD
#define _SELACLK ACLKCON3bits.SELACLK
#define _APLLCK ACLKCON3bits.APLLCK
#define _ENAPLL ACLKCON3bits.ENAPLL
#define _APPLPRE0 ACLKCON3bits.APPLPRE0
#define _APPLPRE1 ACLKCON3bits.APPLPRE1
#define _APPLPRE2 ACLKCON3bits.APPLPRE2
#define _APLLPOST0 ACLKCON3bits.APLLPOST0
#define _APLLPOST1 ACLKCON3bits.APLLPOST1
#define _APLLPOST2 ACLKCON3bits.APLLPOST2
#define _AOSCMD0 ACLKCON3bits.AOSCMD0
#define _AOSCMD1 ACLKCON3bits.AOSCMD1

/* ACLKDIV3 */
#define _APLLDIV ACLKDIV3bits.APLLDIV
#define _APLLDIV0 ACLKDIV3bits.APLLDIV0
#define _APLLDIV1 ACLKDIV3bits.APLLDIV1
#define _APLLDIV2 ACLKDIV3bits.APLLDIV2

/* PMD1 */
#define _AD1MD PMD1bits.AD1MD
#define _C1MD PMD1bits.C1MD
#define _C2MD PMD1bits.C2MD
#define _SPI1MD PMD1bits.SPI1MD
#define _SPI2MD PMD1bits.SPI2MD
#define _U1MD PMD1bits.U1MD
#define _U2MD PMD1bits.U2MD
#define _I2C1MD PMD1bits.I2C1MD
#define _DCIMD PMD1bits.DCIMD
#define _PWMMD PMD1bits.PWMMD
#define _T1MD PMD1bits.T1MD
#define _T2MD PMD1bits.T2MD
#define _T3MD PMD1bits.T3MD
#define _T4MD PMD1bits.T4MD
#define _T5MD PMD1bits.T5MD

/* PMD2 */
#define _OC1MD PMD2bits.OC1MD
#define _OC2MD PMD2bits.OC2MD
#define _OC3MD PMD2bits.OC3MD
#define _OC4MD PMD2bits.OC4MD
#define _OC5MD PMD2bits.OC5MD
#define _OC6MD PMD2bits.OC6MD
#define _OC7MD PMD2bits.OC7MD
#define _OC8MD PMD2bits.OC8MD
#define _IC1MD PMD2bits.IC1MD
#define _IC2MD PMD2bits.IC2MD
#define _IC3MD PMD2bits.IC3MD
#define _IC4MD PMD2bits.IC4MD
#define _IC5MD PMD2bits.IC5MD
#define _IC6MD PMD2bits.IC6MD
#define _IC7MD PMD2bits.IC7MD
#define _IC8MD PMD2bits.IC8MD

/* PMD3 */
#define _AD2MD PMD3bits.AD2MD
#define _I2C2MD PMD3bits.I2C2MD
#define _U3MD PMD3bits.U3MD
#define _DAC1MD PMD3bits.DAC1MD
#define _CRCMD PMD3bits.CRCMD
#define _PMPMD PMD3bits.PMPMD
#define _RTCCMD PMD3bits.RTCCMD
#define _CMPMD PMD3bits.CMPMD
#define _T6MD PMD3bits.T6MD
#define _T7MD PMD3bits.T7MD
#define _T8MD PMD3bits.T8MD
#define _T9MD PMD3bits.T9MD

/* PMD4 */
#define _USB1MD PMD4bits.USB1MD
#define _REFOMD PMD4bits.REFOMD
#define _U4MD PMD4bits.U4MD

/* PMD5 */
#define _OC9MD PMD5bits.OC9MD
#define _OC10MD PMD5bits.OC10MD
#define _OC11MD PMD5bits.OC11MD
#define _OC12MD PMD5bits.OC12MD
#define _OC13MD PMD5bits.OC13MD
#define _OC14MD PMD5bits.OC14MD
#define _OC15MD PMD5bits.OC15MD
#define _OC16MD PMD5bits.OC16MD
#define _IC9MD PMD5bits.IC9MD
#define _IC10MD PMD5bits.IC10MD
#define _IC11MD PMD5bits.IC11MD
#define _IC12MD PMD5bits.IC12MD
#define _IC13MD PMD5bits.IC13MD
#define _IC14MD PMD5bits.IC14MD
#define _IC15MD PMD5bits.IC15MD
#define _IC16MD PMD5bits.IC16MD

