MikroElektronika/core_packages/dsPIC/XC16/def/PIC24EP256GU810/mcu.h
#define _RPINR42_DTCMP5R_POSITION                0x00000000
#define _RPINR42_DTCMP5R_MASK                    0x0000007F
#define _RPINR42_DTCMP5R_LENGTH                  0x00000007

#define _RPINR42_DTCMP6R_POSITION                0x00000008
#define _RPINR42_DTCMP6R_MASK                    0x00007F00
#define _RPINR42_DTCMP6R_LENGTH                  0x00000007

#define _RPINR42_DTCMP5R0_POSITION               0x00000000
#define _RPINR42_DTCMP5R0_MASK                   0x00000001
#define _RPINR42_DTCMP5R0_LENGTH                 0x00000001

#define _RPINR42_DTCMP5R1_POSITION               0x00000001
#define _RPINR42_DTCMP5R1_MASK                   0x00000002
#define _RPINR42_DTCMP5R1_LENGTH                 0x00000001

#define _RPINR42_DTCMP5R2_POSITION               0x00000002
#define _RPINR42_DTCMP5R2_MASK                   0x00000004
#define _RPINR42_DTCMP5R2_LENGTH                 0x00000001

#define _RPINR42_DTCMP5R3_POSITION               0x00000003
#define _RPINR42_DTCMP5R3_MASK                   0x00000008
#define _RPINR42_DTCMP5R3_LENGTH                 0x00000001

#define _RPINR42_DTCMP5R4_POSITION               0x00000004
#define _RPINR42_DTCMP5R4_MASK                   0x00000010
#define _RPINR42_DTCMP5R4_LENGTH                 0x00000001

#define _RPINR42_DTCMP5R5_POSITION               0x00000005
#define _RPINR42_DTCMP5R5_MASK                   0x00000020
#define _RPINR42_DTCMP5R5_LENGTH                 0x00000001

#define _RPINR42_DTCMP5R6_POSITION               0x00000006
#define _RPINR42_DTCMP5R6_MASK                   0x00000040
#define _RPINR42_DTCMP5R6_LENGTH                 0x00000001

#define _RPINR42_DTCMP6R0_POSITION               0x00000008
#define _RPINR42_DTCMP6R0_MASK                   0x00000100
#define _RPINR42_DTCMP6R0_LENGTH                 0x00000001

#define _RPINR42_DTCMP6R1_POSITION               0x00000009
#define _RPINR42_DTCMP6R1_MASK                   0x00000200
#define _RPINR42_DTCMP6R1_LENGTH                 0x00000001

#define _RPINR42_DTCMP6R2_POSITION               0x0000000A
#define _RPINR42_DTCMP6R2_MASK                   0x00000400
#define _RPINR42_DTCMP6R2_LENGTH                 0x00000001

#define _RPINR42_DTCMP6R3_POSITION               0x0000000B
#define _RPINR42_DTCMP6R3_MASK                   0x00000800
#define _RPINR42_DTCMP6R3_LENGTH                 0x00000001

#define _RPINR42_DTCMP6R4_POSITION               0x0000000C
#define _RPINR42_DTCMP6R4_MASK                   0x00001000
#define _RPINR42_DTCMP6R4_LENGTH                 0x00000001

#define _RPINR42_DTCMP6R5_POSITION               0x0000000D
#define _RPINR42_DTCMP6R5_MASK                   0x00002000
#define _RPINR42_DTCMP6R5_LENGTH                 0x00000001

#define _RPINR42_DTCMP6R6_POSITION               0x0000000E
#define _RPINR42_DTCMP6R6_MASK                   0x00004000
#define _RPINR42_DTCMP6R6_LENGTH                 0x00000001

#define _RPINR43_DTCMP7R_POSITION                0x00000000
#define _RPINR43_DTCMP7R_MASK                    0x0000007F
#define _RPINR43_DTCMP7R_LENGTH                  0x00000007

#define _RPINR43_DTCMP7R0_POSITION               0x00000000
#define _RPINR43_DTCMP7R0_MASK                   0x00000001
#define _RPINR43_DTCMP7R0_LENGTH                 0x00000001

#define _RPINR43_DTCMP7R1_POSITION               0x00000001
#define _RPINR43_DTCMP7R1_MASK                   0x00000002
#define _RPINR43_DTCMP7R1_LENGTH                 0x00000001

#define _RPINR43_DTCMP7R2_POSITION               0x00000002
#define _RPINR43_DTCMP7R2_MASK                   0x00000004
#define _RPINR43_DTCMP7R2_LENGTH                 0x00000001

#define _RPINR43_DTCMP7R3_POSITION               0x00000003
#define _RPINR43_DTCMP7R3_MASK                   0x00000008
#define _RPINR43_DTCMP7R3_LENGTH                 0x00000001

#define _RPINR43_DTCMP7R4_POSITION               0x00000004
#define _RPINR43_DTCMP7R4_MASK                   0x00000010
#define _RPINR43_DTCMP7R4_LENGTH                 0x00000001

#define _RPINR43_DTCMP7R5_POSITION               0x00000005
#define _RPINR43_DTCMP7R5_MASK                   0x00000020
#define _RPINR43_DTCMP7R5_LENGTH                 0x00000001

#define _RPINR43_DTCMP7R6_POSITION               0x00000006
#define _RPINR43_DTCMP7R6_MASK                   0x00000040
#define _RPINR43_DTCMP7R6_LENGTH                 0x00000001

#define _RPINR45_SYNCI1R_POSITION                0x00000000
#define _RPINR45_SYNCI1R_MASK                    0x0000007F
#define _RPINR45_SYNCI1R_LENGTH                  0x00000007

#define _RPINR45_SYNCI2R_POSITION                0x00000008
#define _RPINR45_SYNCI2R_MASK                    0x00007F00
#define _RPINR45_SYNCI2R_LENGTH                  0x00000007

#define _RPINR45_SYNCI1R0_POSITION               0x00000000
#define _RPINR45_SYNCI1R0_MASK                   0x00000001
#define _RPINR45_SYNCI1R0_LENGTH                 0x00000001

#define _RPINR45_SYNCI1R1_POSITION               0x00000001
#define _RPINR45_SYNCI1R1_MASK                   0x00000002
#define _RPINR45_SYNCI1R1_LENGTH                 0x00000001

#define _RPINR45_SYNCI1R2_POSITION               0x00000002
#define _RPINR45_SYNCI1R2_MASK                   0x00000004
#define _RPINR45_SYNCI1R2_LENGTH                 0x00000001

#define _RPINR45_SYNCI1R3_POSITION               0x00000003
#define _RPINR45_SYNCI1R3_MASK                   0x00000008
#define _RPINR45_SYNCI1R3_LENGTH                 0x00000001

#define _RPINR45_SYNCI1R4_POSITION               0x00000004
#define _RPINR45_SYNCI1R4_MASK                   0x00000010
#define _RPINR45_SYNCI1R4_LENGTH                 0x00000001

#define _RPINR45_SYNCI1R5_POSITION               0x00000005
#define _RPINR45_SYNCI1R5_MASK                   0x00000020
#define _RPINR45_SYNCI1R5_LENGTH                 0x00000001

#define _RPINR45_SYNCI1R6_POSITION               0x00000006
#define _RPINR45_SYNCI1R6_MASK                   0x00000040
#define _RPINR45_SYNCI1R6_LENGTH                 0x00000001

#define _RPINR45_SYNCI2R0_POSITION               0x00000008
#define _RPINR45_SYNCI2R0_MASK                   0x00000100
#define _RPINR45_SYNCI2R0_LENGTH                 0x00000001

#define _RPINR45_SYNCI2R1_POSITION               0x00000009
#define _RPINR45_SYNCI2R1_MASK                   0x00000200
#define _RPINR45_SYNCI2R1_LENGTH                 0x00000001

#define _RPINR45_SYNCI2R2_POSITION               0x0000000A
#define _RPINR45_SYNCI2R2_MASK                   0x00000400
#define _RPINR45_SYNCI2R2_LENGTH                 0x00000001

#define _RPINR45_SYNCI2R3_POSITION               0x0000000B
#define _RPINR45_SYNCI2R3_MASK                   0x00000800
#define _RPINR45_SYNCI2R3_LENGTH                 0x00000001

#define _RPINR45_SYNCI2R4_POSITION               0x0000000C
#define _RPINR45_SYNCI2R4_MASK                   0x00001000
#define _RPINR45_SYNCI2R4_LENGTH                 0x00000001

#define _RPINR45_SYNCI2R5_POSITION               0x0000000D
#define _RPINR45_SYNCI2R5_MASK                   0x00002000
#define _RPINR45_SYNCI2R5_LENGTH                 0x00000001

#define _RPINR45_SYNCI2R6_POSITION               0x0000000E
#define _RPINR45_SYNCI2R6_MASK                   0x00004000
#define _RPINR45_SYNCI2R6_LENGTH                 0x00000001

