MikroElektronika/core_packages/dsPIC/XC16/def/PIC24EP256GU810/mcu.h
#define _REFOCON_ROSEL_POSITION                  0x0000000C
#define _REFOCON_ROSEL_MASK                      0x00001000
#define _REFOCON_ROSEL_LENGTH                    0x00000001

#define _REFOCON_ROSSLP_POSITION                 0x0000000D
#define _REFOCON_ROSSLP_MASK                     0x00002000
#define _REFOCON_ROSSLP_LENGTH                   0x00000001

#define _REFOCON_ROON_POSITION                   0x0000000F
#define _REFOCON_ROON_MASK                       0x00008000
#define _REFOCON_ROON_LENGTH                     0x00000001

#define _REFOCON_RODIV0_POSITION                 0x00000008
#define _REFOCON_RODIV0_MASK                     0x00000100
#define _REFOCON_RODIV0_LENGTH                   0x00000001

#define _REFOCON_RODIV1_POSITION                 0x00000009
#define _REFOCON_RODIV1_MASK                     0x00000200
#define _REFOCON_RODIV1_LENGTH                   0x00000001

#define _REFOCON_RODIV2_POSITION                 0x0000000A
#define _REFOCON_RODIV2_MASK                     0x00000400
#define _REFOCON_RODIV2_LENGTH                   0x00000001

#define _REFOCON_RODIV3_POSITION                 0x0000000B
#define _REFOCON_RODIV3_MASK                     0x00000800
#define _REFOCON_RODIV3_LENGTH                   0x00000001

#define _ACLKCON3_APLLPRE_POSITION               0x00000000
#define _ACLKCON3_APLLPRE_MASK                   0x00000007
#define _ACLKCON3_APLLPRE_LENGTH                 0x00000003

#define _ACLKCON3_APLLPOST_POSITION              0x00000005
#define _ACLKCON3_APLLPOST_MASK                  0x000000E0
#define _ACLKCON3_APLLPOST_LENGTH                0x00000003

#define _ACLKCON3_FRCSEL_POSITION                0x00000009
#define _ACLKCON3_FRCSEL_MASK                    0x00000200
#define _ACLKCON3_FRCSEL_LENGTH                  0x00000001

#define _ACLKCON3_ASRCSEL_POSITION               0x0000000A
#define _ACLKCON3_ASRCSEL_MASK                   0x00000400
#define _ACLKCON3_ASRCSEL_LENGTH                 0x00000001

#define _ACLKCON3_AOSCMD_POSITION                0x0000000B
#define _ACLKCON3_AOSCMD_MASK                    0x00001800
#define _ACLKCON3_AOSCMD_LENGTH                  0x00000002

#define _ACLKCON3_SELACLK_POSITION               0x0000000D
#define _ACLKCON3_SELACLK_MASK                   0x00002000
#define _ACLKCON3_SELACLK_LENGTH                 0x00000001

#define _ACLKCON3_APLLCK_POSITION                0x0000000E
#define _ACLKCON3_APLLCK_MASK                    0x00004000
#define _ACLKCON3_APLLCK_LENGTH                  0x00000001

#define _ACLKCON3_ENAPLL_POSITION                0x0000000F
#define _ACLKCON3_ENAPLL_MASK                    0x00008000
#define _ACLKCON3_ENAPLL_LENGTH                  0x00000001

#define _ACLKCON3_APPLPRE0_POSITION              0x00000000
#define _ACLKCON3_APPLPRE0_MASK                  0x00000001
#define _ACLKCON3_APPLPRE0_LENGTH                0x00000001

#define _ACLKCON3_APPLPRE1_POSITION              0x00000001
#define _ACLKCON3_APPLPRE1_MASK                  0x00000002
#define _ACLKCON3_APPLPRE1_LENGTH                0x00000001

#define _ACLKCON3_APPLPRE2_POSITION              0x00000002
#define _ACLKCON3_APPLPRE2_MASK                  0x00000004
#define _ACLKCON3_APPLPRE2_LENGTH                0x00000001

#define _ACLKCON3_APLLPOST0_POSITION             0x00000005
#define _ACLKCON3_APLLPOST0_MASK                 0x00000020
#define _ACLKCON3_APLLPOST0_LENGTH               0x00000001

#define _ACLKCON3_APLLPOST1_POSITION             0x00000006
#define _ACLKCON3_APLLPOST1_MASK                 0x00000040
#define _ACLKCON3_APLLPOST1_LENGTH               0x00000001

#define _ACLKCON3_APLLPOST2_POSITION             0x00000007
#define _ACLKCON3_APLLPOST2_MASK                 0x00000080
#define _ACLKCON3_APLLPOST2_LENGTH               0x00000001

#define _ACLKCON3_AOSCMD0_POSITION               0x0000000B
#define _ACLKCON3_AOSCMD0_MASK                   0x00000800
#define _ACLKCON3_AOSCMD0_LENGTH                 0x00000001

#define _ACLKCON3_AOSCMD1_POSITION               0x0000000C
#define _ACLKCON3_AOSCMD1_MASK                   0x00001000
#define _ACLKCON3_AOSCMD1_LENGTH                 0x00000001

#define _ACLKDIV3_APLLDIV_POSITION               0x00000000
#define _ACLKDIV3_APLLDIV_MASK                   0x00000007
#define _ACLKDIV3_APLLDIV_LENGTH                 0x00000003

#define _ACLKDIV3_APLLDIV0_POSITION              0x00000000
#define _ACLKDIV3_APLLDIV0_MASK                  0x00000001
#define _ACLKDIV3_APLLDIV0_LENGTH                0x00000001

#define _ACLKDIV3_APLLDIV1_POSITION              0x00000001
#define _ACLKDIV3_APLLDIV1_MASK                  0x00000002
#define _ACLKDIV3_APLLDIV1_LENGTH                0x00000001

#define _ACLKDIV3_APLLDIV2_POSITION              0x00000002
#define _ACLKDIV3_APLLDIV2_MASK                  0x00000004
#define _ACLKDIV3_APLLDIV2_LENGTH                0x00000001

#define _PMD1_AD1MD_POSITION                     0x00000000
#define _PMD1_AD1MD_MASK                         0x00000001
#define _PMD1_AD1MD_LENGTH                       0x00000001

#define _PMD1_C1MD_POSITION                      0x00000001
#define _PMD1_C1MD_MASK                          0x00000002
#define _PMD1_C1MD_LENGTH                        0x00000001

#define _PMD1_C2MD_POSITION                      0x00000002
#define _PMD1_C2MD_MASK                          0x00000004
#define _PMD1_C2MD_LENGTH                        0x00000001

#define _PMD1_SPI1MD_POSITION                    0x00000003
#define _PMD1_SPI1MD_MASK                        0x00000008
#define _PMD1_SPI1MD_LENGTH                      0x00000001

#define _PMD1_SPI2MD_POSITION                    0x00000004
#define _PMD1_SPI2MD_MASK                        0x00000010
#define _PMD1_SPI2MD_LENGTH                      0x00000001

#define _PMD1_U1MD_POSITION                      0x00000005
#define _PMD1_U1MD_MASK                          0x00000020
#define _PMD1_U1MD_LENGTH                        0x00000001

#define _PMD1_U2MD_POSITION                      0x00000006
#define _PMD1_U2MD_MASK                          0x00000040
#define _PMD1_U2MD_LENGTH                        0x00000001

#define _PMD1_I2C1MD_POSITION                    0x00000007
#define _PMD1_I2C1MD_MASK                        0x00000080
#define _PMD1_I2C1MD_LENGTH                      0x00000001

#define _PMD1_DCIMD_POSITION                     0x00000008
#define _PMD1_DCIMD_MASK                         0x00000100
#define _PMD1_DCIMD_LENGTH                       0x00000001

#define _PMD1_PWMMD_POSITION                     0x00000009
#define _PMD1_PWMMD_MASK                         0x00000200
#define _PMD1_PWMMD_LENGTH                       0x00000001

#define _PMD1_T1MD_POSITION                      0x0000000B
#define _PMD1_T1MD_MASK                          0x00000800
#define _PMD1_T1MD_LENGTH                        0x00000001

#define _PMD1_T2MD_POSITION                      0x0000000C
#define _PMD1_T2MD_MASK                          0x00001000
#define _PMD1_T2MD_LENGTH                        0x00000001

#define _PMD1_T3MD_POSITION                      0x0000000D
#define _PMD1_T3MD_MASK                          0x00002000
#define _PMD1_T3MD_LENGTH                        0x00000001

#define _PMD1_T4MD_POSITION                      0x0000000E
#define _PMD1_T4MD_MASK                          0x00004000
#define _PMD1_T4MD_LENGTH                        0x00000001

#define _PMD1_T5MD_POSITION                      0x0000000F
#define _PMD1_T5MD_MASK                          0x00008000
#define _PMD1_T5MD_LENGTH                        0x00000001

#define _PMD2_OC1MD_POSITION                     0x00000000
#define _PMD2_OC1MD_MASK                         0x00000001
#define _PMD2_OC1MD_LENGTH                       0x00000001

#define _PMD2_OC2MD_POSITION                     0x00000001
#define _PMD2_OC2MD_MASK                         0x00000002
#define _PMD2_OC2MD_LENGTH                       0x00000001

