MikroElektronika/core_packages/dsPIC/XC16/def/PIC24EP256GU810/mcu.h
#define POSCMD_EC            0x00E4
#define POSCMD_XT            0x00E5
#define POSCMD_HS            0x00E6
#define POSCMD_NONE          0x00E7

#define OSCIOFNC_ON          0x00E3
#define OSCIOFNC_OFF         0x00E7

#define IOL1WAY_OFF          0x00C7
#define IOL1WAY_ON           0x00E7

#define FCKSM_CSECME         0x0027
#define FCKSM_CSECMD         0x0067
#define FCKSM_CSDCMD         0x00A7

/* Register FWDT (0xf8000a)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FWDT;
#define _FWDT(x) __attribute__((address(0xf8000a),deprecated_definition("consider migrating to #pragma config"),section("__FWDT.sec"),space(prog))) __prog__ uint16_t _FWDT = (x);

/*
** Only one invocation of FWDT should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FWDT.
** Multiple options may be combined, as shown:
**
** _FWDT( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Watchdog Timer Postscaler bits:
**     WDTPOST_PS1          1:1
**     WDTPOST_PS2          1:2
**     WDTPOST_PS4          1:4
**     WDTPOST_PS8          1:8
**     WDTPOST_PS16         1:16
**     WDTPOST_PS32         1:32
**     WDTPOST_PS64         1:64
**     WDTPOST_PS128        1:128
**     WDTPOST_PS256        1:256
**     WDTPOST_PS512        1:512
**     WDTPOST_PS1024       1:1,024
**     WDTPOST_PS2048       1:2,048
**     WDTPOST_PS4096       1:4,096
**     WDTPOST_PS8192       1:8,192
**     WDTPOST_PS16384      1:16,384
**     WDTPOST_PS32768      1:32,768
**
**   Watchdog Timer Prescaler bit:
**     WDTPRE_PR32          1:32
**     WDTPRE_PR128         1:128
**
**   PLL Lock Wait Enable bit:
**     PLLKEN_OFF           Clock switch will not wait for the PLL lock signal.
**     PLLKEN_ON            Clock switch to PLL source will wait until the PLL lock signal is valid.
**
**   Watchdog Timer Window Enable bit:
**     WINDIS_ON            Watchdog Timer in Window mode
**     WINDIS_OFF           Watchdog Timer in Non-Window mode
**
**   Watchdog Timer Enable bit:
**     FWDTEN_OFF           Watchdog timer enabled/disabled by user software
**     FWDTEN_ON            Watchdog timer always enabled
**
*/

#define WDTPOST_PS1          0x00F0
#define WDTPOST_PS2          0x00F1
#define WDTPOST_PS4          0x00F2
#define WDTPOST_PS8          0x00F3
#define WDTPOST_PS16         0x00F4
#define WDTPOST_PS32         0x00F5
#define WDTPOST_PS64         0x00F6
#define WDTPOST_PS128        0x00F7
#define WDTPOST_PS256        0x00F8
#define WDTPOST_PS512        0x00F9
#define WDTPOST_PS1024       0x00FA
#define WDTPOST_PS2048       0x00FB
#define WDTPOST_PS4096       0x00FC
#define WDTPOST_PS8192       0x00FD
#define WDTPOST_PS16384      0x00FE
#define WDTPOST_PS32768      0x00FF

#define WDTPRE_PR32          0x00EF
#define WDTPRE_PR128         0x00FF

#define PLLKEN_OFF           0x00DF
#define PLLKEN_ON            0x00FF

#define WINDIS_ON            0x00BF
#define WINDIS_OFF           0x00FF

#define FWDTEN_OFF           0x007F
#define FWDTEN_ON            0x00FF

/* Register FPOR (0xf8000c)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FPOR;
#define _FPOR(x) __attribute__((address(0xf8000c),deprecated_definition("consider migrating to #pragma config"),section("__FPOR.sec"),space(prog))) __prog__ uint16_t _FPOR = (x);

/*
** Only one invocation of FPOR should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FPOR.
** Multiple options may be combined, as shown:
**
** _FPOR( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Power-on Reset Timer Value Select bits:
**     FPWRT_PWR1           Disabled
**     FPWRT_PWR2           2ms
**     FPWRT_PWR4           4ms
**     FPWRT_PWR8           8ms
**     FPWRT_PWR16          16ms
**     FPWRT_PWR32          32ms
**     FPWRT_PWR64          64ms
**     FPWRT_PWR128         128ms
**
**   Brown-out Reset (BOR) Detection Enable bit:
**     BOREN_OFF            BOR is disabled
**     BOREN_ON             BOR is enabled
**
**   Alternate I2C pins for I2C1:
**     ALTI2C1_ON           ASDA1/ASCK1 pins are selected as the I/O pins for I2C1
**     ALTI2C1_OFF          SDA1/SCK1 pins are selected as the I/O pins for I2C1
**
**   Alternate I2C pins for I2C2:
**     ALTI2C2_ON           ASDA2/ASCK2 pins are selected as the I/O pins for I2C2
**     ALTI2C2_OFF          SDA2/SCK2 pins are selected as the I/O pins for I2C2
**
*/

#define FPWRT_PWR1           0x0038
#define FPWRT_PWR2           0x0039
#define FPWRT_PWR4           0x003A
#define FPWRT_PWR8           0x003B
#define FPWRT_PWR16          0x003C
#define FPWRT_PWR32          0x003D
#define FPWRT_PWR64          0x003E
#define FPWRT_PWR128         0x003F

#define BOREN_OFF            0x0037
#define BOREN_ON             0x003F

#define ALTI2C1_ON           0x002F
#define ALTI2C1_OFF          0x003F

#define ALTI2C2_ON           0x001F
#define ALTI2C2_OFF          0x003F

/* Register FICD (0xf8000e)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FICD;
#define _FICD(x) __attribute__((address(0xf8000e),deprecated_definition("consider migrating to #pragma config"),section("__FICD.sec"),space(prog))) __prog__ uint16_t _FICD = (x);

/*
** Only one invocation of FICD should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FICD.
** Multiple options may be combined, as shown:
**
** _FICD( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   ICD Communication Channel Select bits:
**     ICS_NONE             Reserved, do not use
**     ICS_PGD3             Communicate on PGEC3 and PGED3
**     ICS_PGD2             Communicate on PGEC2 and PGED2
**     ICS_PGD1             Communicate on PGEC1 and PGED1
**
**   Reset Target Vector Select bit:
**     RSTPRI_AF            Device will obtain reset instruction from Aux flash
**     RSTPRI_PF            Device will obtain reset instruction from Primary flash
**
**   JTAG Enable bit:
**     JTAGEN_OFF           JTAG is disabled
**     JTAGEN_ON            JTAG is enabled
**
*/

#define ICS_NONE             0x00F4
#define ICS_PGD3             0x00F5
#define ICS_PGD2             0x00F6
#define ICS_PGD1             0x00F7

#define RSTPRI_AF            0x00F3
#define RSTPRI_PF            0x00F7

#define JTAGEN_OFF           0x00D7
#define JTAGEN_ON            0x00F7

/* Register FAS (0xf80010)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FAS;
#define _FAS(x) __attribute__((address(0xf80010),deprecated_definition("consider migrating to #pragma config"),section("__FAS.sec"),space(prog))) __prog__ uint16_t _FAS = (x);

